package com.example.convertorsytem.presentation.ui.nav_questions

import android.os.Bundle
import android.view.View
import androidx.fragment.app.Fragment
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.DividerItemDecoration
import by.kirich1409.viewbindingdelegate.viewBinding
import com.example.convertorsytem.R
import com.example.convertorsytem.databinding.PageQuestionsBinding
import com.example.convertorsytem.presentation.ui.nav_questions.adapter.QuestionRvAdapter
import com.example.convertorsytem.presentation.ui.nav_questions.models.Questions
import com.example.convertorsytem.utils.scope

class QuestionsPage:Fragment(R.layout.page_questions) {

    private val binding by viewBinding(PageQuestionsBinding::bind)
    private lateinit var questionRvAdapter : QuestionRvAdapter
    private lateinit var questionList : ArrayList<Questions>

    override fun onViewCreated(view : View , savedInstanceState : Bundle?) = binding.scope {
        super.onViewCreated(view , savedInstanceState)

        loadData()
        questionRvAdapter =
            QuestionRvAdapter(questionList , object:QuestionRvAdapter.OnQuestionItemListener {
                override fun onItemClick(questions : Questions) {
                    findNavController().navigate(
                        QuestionsPageDirections.actionQuestionsPageToAnswersScreen(
                            questions
                        )
                    )
                }
            })
        val dividerItemDecoration =
            DividerItemDecoration(requireContext() , DividerItemDecoration.VERTICAL)
        rvQuestions.addItemDecoration(dividerItemDecoration)
        rvQuestions.adapter = questionRvAdapter

    }

    private fun loadData() {
        questionList = ArrayList()
        val quesLists = arrayListOf(
            "Ўзбекистон Республикасида қандай идора валютани тартибга солувчи давлат идораси ҳисобланади?" ,
            "Ўзбекистон Республикасида қандай давлат идораларивалюта назорати идоралари ҳисобланади?" ,
            "Валюта операцияларини амалга оширишга доир чекловлар қандай мақсадларда ва ким томонидан белгиланиши мумкин?" ,
            "Валюта бойликларига нималар киради?" ,
            "Валюта операцияларини санаб беринг?" ,
            "Валюта операциялари қандай турларга бўлинади?" ,
            "Жорий халқаро операцияларга қайси операциялар киради?" ,
            "Капитал ҳаракати билан боғлиқ валюта операцияларига қайси операциялар киради?" ,
            "Капитал ҳаракати билан боғлиқ валюта операциялари амалга ошириш учун резидент томонидан ваколатли банкка қандай ҳужжатлар тақдим этиши керак?" ,
            "Чет эл валютаси билан боғлиқ бўлган ҳосила молиявий воситалар деганда нимани тушунасиз?" ,
            "Ўзбекистон Республикасида резидентлари томонидан нақд чет эл валютаси ва миллий валютани олиб кириш ҳамда олиб чиқиш тартиб қандай?" ,
            "Ўзбекистон Республикасида норезидентлари томонидан нақд чет эл валютаси ва миллий валютани олиб кириш ҳамда олиб чиқиш тартиб қандай?" ,
            "Резидент ҳамда норезидент юридик шахслар томонидан нақд чет эл валютаси ва миллий валютани олиб кириш ҳамда олиб чиқиш бўйича операциялар қандай тартибда амалга оширилади?" ,
            "Ваколатли банклар чет эл валютасида операцияларни амалга оширишда қандай хуқуқларга эга?" ,
            "Ўзбекистон Республикаси ҳудудида юридик ва жисмоний шахслар томонидан чет эл валютасини сотиб олиш ва сотиш бўйича операциялар қандай тартибда амалга оширилади?" ,
            "Импорт шартномалари бўйича муддати ўтган дебитор қарздорлиги ҳолати қайси муддатда юзага келади ва ушбу тартиб қайси қонунчилик ҳужжатида белгиланган?" ,
            "Экспорт операциялари бўйича валюта тушиши ва импорт операциялари бўйича товарлар келитрилишини кафолатлайдиган қандай тўлов турларини биласиз?" ,
            "Юридик шахс - резидент чет эл банкларида хорижий валюта ва миллий валютада ҳисобварақларни очишга рухсатнома олиши учун Марказий банкка қандай ҳужжатларни тақдим этиши керак?" ,

            )

        val answerList = arrayListOf(
            "Жавоб: Валютани тартибга солувчи давлат идораси Марказий банк." ,
            "Жавоб: Валюта назорати идоралари: Марказий банк, Давлат солиқ қўмитаси, Давлат божхона қўмитаси ва Молия вазирлиги." ,
            "Жавоб: Валюта операцияларини амалга оширишга доир чекловлар жиноий фаолиятдан олинган даромадларни легаллаштиришга ҳамда терроризмни молиялаштиришга қарши кўрашиш мақсадида белгиланиши мумкин. Ўзбекистон Республикаси Марказий банки томонидан иқтисодий ҳавфсизликка тахдидлар пайдо бўлганда ҳам ушбу чекловлар қўлланиши мумкин." ,
            "Жавоб: Чет эл валютаси, чет эл валютасидаги қимматли қоғозлар, чет эл валютасидаги тўлов ҳужжатлари ва соф қуйма олтин валюта бойликлари ҳисобланади." ,
            "Жавоб: Валюта операцияларига қуйидагилар киради:\n" +
                    "валюта бойликларига бўлган мулк ҳуқуқининг ва бошқа ҳуқуқларнинг ўзга шахсга ўтиши ҳамда валюта бойликларини тўлов воситаси сифатида ишлатиш билан боғлиқ операциялар;\n" +
                    "валюта бойликларини Ўзбекистон Республикасига олиб кириш ва жўнатиш, шунингдек Ўзбекистон Республикасидан олиб чиқиш ва жўнатиш;\n" +
                    "халқаро пул жўнатмаларини амалга ошириш;\n" +
                    "резидентлар ва норезидентлар ўртасида миллий валютадаги операциялар." ,
            "Жавоб: Валюта операциялари жорий халқаро операцияларга ҳамда капитал ҳаракати билан боғлиқ валюта операцияларига бўлинади." ,
            "Жавоб: ташқи савдо, бошқа жорий фаолият олиб борилиши, шу жумладан, хизматлар кўрсатилиши муносабати билан, шунингдек одатдаги қисқа муддатли банк ва кредит механизмлари ишлаши муносабати билан тўланиши зарур барча тўловлар;\n" +
                    "фоизлар ва бошқа даромадлар кўринишида, шу жумладан, банк омонатлари, кредитлар ҳамда лизинг бўйича олинадиган фоизлар ва бошқа даромадлар шаклида, шунингдек бошқа инвестициялардан олинадиган соф даромад шаклида тўланиши зарур тўловлар;\n" +
                    "кредитларни, қарзларни ўзиш учун ёки тўғридан-тўғри инвестициялар амортизацияси учун мақбул суммаларни тўлаш;\n" +
                    "савдо билан боғлиқ бўлмаган пул жўнатмаларининг мақбул суммалари." ,
            "Жавоб: Капитал ҳаракати билан боғлиқ валюта операцияларига жорий халқаро операциялар ҳисобланмайдиган барча операциялар, шу жумладан:\n" +
                    "инвестиция фаолиятини амалга ошириш;\n" +
                    "кредитлар олиш ва бериш, лизинг операцияларини амалга ошириш;\n" +
                    "кўчмас мулкни сотиб олиш ва сотиш;\n" +
                    "хорижий давлатлардан маблағларни ҳисобварақлар ва омонатларга жалб этиш ҳамда хорижий давлатларда маблағларни ҳисобварақлар ва омонатларга жойлаштириш киради." ,
            "Жавоб: Капитал ҳаракати билан боғлиқ валюта операцияларини амалга ошириш учун резидент томонидан ваколатли банкка қуйидаги ҳужжатлар тақдим этилади:\n" +
                    "Марказий банкнинг «Капитал ҳаракати билан боғлиқ айрим валюта операцияларини амалга ошириш тартиби тўғрисида»ги Низомнинг 1-иловасига мувофиқ ариза;\n" +
                    "валюта операцияси амалга оширилишини назарда тутувчи ҳужжатнинг (шартнома, келишув, битим ва/ёки бошқа ҳужжат) ҳамда унга киритилган ўзгартириш ва қўшимчаларнинг нусхалари. Бунда ҳужжат матни давлат ёки рус тилида баён этилган бўлиши, агар ҳужжат матни бошқа тилда баён этилган бўлса, у легаллаштирилган ёки унга белгиланган тартибда апостиль қўйилган бўлиши ҳамда давлат ёки рус тилига таржима қилинган ва нотариал тасдиқланган бўлиши керак." ,
            "Жавоб: Чет эл валютаси билан боғлиқ бўлган ҳосила молиявий воситалар (валюта деривативлари) чет эл валютаси олди-сотдиси бўйича шартномалар бўлиб, уларда белгиланган мажбуриятлар муайян муддат ўтгач ёки чет эл валютасининг қийматига ёхуд унинг курси ўзгаришига боғлиқ равишда бажарилиши мумкин." ,
            "Жавоб: Жисмоний шахсларнинг Ўзбекистон Республикаси ҳудудига нақд чет эл валютасини олиб кириши чекловларсиз амалга оширилади.\n" +
                    "Резидент жисмоний шахслар нақд чет эл валютасини олиб чиқиш ҳуқуқини тасдиқловчи ҳужжатларни кўрсатмасдан қонун ҳужжатларида белгиланган миқдордаги (2000 АҚШ доллари эквивалентида) нақд чет эл валютасини Ўзбекистон Республикасидан бир йўла олиб чиқишлари мумкин.\n" +
                    "Қонун ҳужжатларида белгиланган миқдордан ортиқ бўлган нақд чет эл валютасининг резидент жисмоний шахслар томонидан олиб чиқилиши уларда Ўзбекистон Республикаси Марказий банки ёки ваколатли банклар томонидан бериладиган, Ўзбекистон Республикасидан нақд чет эл валютасини олиб чиқиш ҳуқуқини тасдиқловчи ҳужжатлар бўлган тақдирда амалга оширилади." ,
            "Жавоб: божхона декларациясига мувофиқ олиб кирилган нақд чет эл валютаси миқдоридаги нақд чет эл валютасини;\n" +
                    "Ўзбекистон Республикаси Марказий банки ва ваколатли банклар томонидан бериладиган, уларнинг нақд чет эл валютасини олиб чиқиш ҳуқуқини тасдиқловчи ҳужжатлар бўлган тақдирда эса олиб кирилган нақд чет эл валютасидан кўп бўлган миқдордаги нақд чет эл валютасини Ўзбекистон Республикасидан бир йўла олиб чиқишлари мумкин." ,
            "Жавоб: Резидент ҳамда норезидент юридик шахслар томонидан нақд чет эл валютаси ва миллий валютани олиб кириш ҳамда олиб чиқиш бўйича операцияларни амалга ошириш тақиқланади, Ўзбекистон Республикаси Марказий банки ва ваколатли банклар бундан мустасно.\n" +
                    "Ваколатли банклар томонидан нақд чет эл валютаси ва миллий валютани олиб кириш ҳамда олиб чиқиш Ўзбекистон Республикаси Марказий банкининг рухсатномаси бўлган тақдирда амалга оширилади." ,
            "Жавоб: Ўзбекистон Республикаси ҳудудида очиқ валюта мавқеи лимити доирасида чет эл валютасини сотиб олиш ва сотиш бўйича, шу жумладан, ҳосила молиявий воситалар асосида чет эл валютасини сотиб олиш ва сотиш бўйича бевосита ўзаро, ўз мижозлари билан ҳамда валюта биржалари орқали, шунингдек халқаро бозорларда операцияларни амалга оширишга;\n" +
                    "Ўзбекистон Республикасининг банкларида ва чет эл банкларида вакиллик ҳисобварақларига ҳамда бошқа ҳисобварақларга эга бўлишга;\n" +
                    "нақд чет эл валютасини ҳамда чет эл валютасидаги тўлов ҳужжатларини жисмоний шахслардан сотиб олиш ва уларга сотиш операцияларини амалга ошириш учун айирбошлаш шохобчаларини очишга ҳақлидир." ,
            "Жавоб: Юридик шахслар томонидан ваколатли банклар орқали ва жисмоний шахслар томонидан ваколатли банклар, уларнинг филиаллари ва айирбошлаш шаҳобчалари орқали." ,
            "Жавоб: Ўзбекистон Республикаси Президенти ва Ўзбекистон Республикаси Вазирлар Маҳкамаси қарорларига мувофиқ амалга оширилаётган лойиҳалар доирасида тузилган контрактлар бўйича ёки контрактлар маҳсулот тақсимотига оид битимларни амалга ошириш доирасида Бошқарувчи қўмита томонидан тасдиқланган тақдирда - импорт контрактларида белгиланган товарларни етказиб бериш (ишларни бажариш, хизматлар кўрсатиш) муддатлари тугагандан кейин;\n" +
                    "бошқа импорт контрактлари бўйича - олдиндан тўлов амалга оширилган кундан бошлаб 180 календарь кун ўтгандан кейин тўлов муддати ўтказиб юборилган дебитор қарздорлик ҳисобланади." ,
            "Жавоб:Экспорт операциялари бўйича олдиндан тўлов, аккредитив, банк кафолати;\n" +
                    "Импорт операциялари бўйича товарлар республики ҳудудига келтирилганда, аккредитив, банк кафолати." ,
            "Жавоб: Юридик шахс - резидент чет эл банкларида хорижий валюта ва миллий валютада ҳисобварақларни очишга рухсатнома олиши учун Марказий банкка қуйидаги ҳужжатларни тақдим этади:\n" +
                    "Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2014 йил 10 мартдаги 56-сон қарори билан тасдиқланган «Резидент-юридик шахслар томонидан чет элда ҳисобварақлар очиш учун рухсатномалар бериш тартиби тўғрисида»ги Низомнинг 3-иловасига мувофиқ шаклда ариза;\n" +
                    "юридик шахснинг давлат рўйхатидан ўтказилганлиги тўғрисидаги гувоҳнома нусхаси;\n" +
                    "аризачи томонидан чет эл банкларида миллий ва (ёки) хорижий валютада ҳисобварақлар очилиши ва фойдаланиши кўзда тутилган Ўзбекистон Республикаси Президенти ҳужжатлари ва Ўзбекистон Республикаси Вазирлар Маҳкамасининг қарорлари ёки Ўзбекистон Республикасининг халқаро шартномалари нусхалари."
        )

        for (i in 0 until 16)
            questionList.add(
                Questions(
                    id = i ,
                    questions = quesLists[i] ,
                    answer = answerList[i] ,
                    data = "15.06.2022"
                )
            )

    }
}